/**
 * @author Перевозчиков Даниил
 * Вывести на экран “Hello world!”
 */

#include "stdio.h"

int main(void)
{
    printf("Hello world!");
    return 0;
}