/**
 * @author Перевозчиков Даниил
 * Вывести на экран текст "лесенкой"
 *	 Let’s
 *      go
 *			to walk
 */

#include "stdio.h"

int main(void) {
    printf("	 Let's\n           go\n             to walk");
    return 0;
}