/**
 * @author Перевозчиков Даниил
 * Вывести на экран рисунок из букв
 *    *
 *   ***
 *  *****
 * *******
 *  HHOHH
 *  ZZZZZ
 */

#include "stdio.h"

int main(void)
{
    printf("     *\n    ***\n   *****\n  *******\n   HHOHH\n   ZZZZZ");
    return 0;
}