/**
 * @author Перевозчиков Даниил
 * --------------------------------------
 * @details - F4 - Написать только одну функцию. Всю программу отправлять не надо. Вывести в порядке возрастания цифры, 
 * входящие в строку. Цифра - количество. Функция должно строго соответствовать прототипу
 * --------------------------------------
 */

#include "stdio.h"

void print_digit(char s[])
{
    int count[11] = {0};

    for (int i = 0; s[i] != '\0'; i++)
    {
        if (s[i] >= '0' && s[i] <= '9')
        {
            count[s[i] - '0']++;
        }
    }

    for (int i = 0; i < 11; i++)
    {
        if (count[i] > 0) {
            printf("%d %d\n", i, count[i]);
        }
    }
}

int main()
{
    char s[100], c;
    int i = 0;
    while ((c=getchar()) != '.')
    {
        s[i++] = c;
    }
    print_digit(s);
}