/**
 * @author Перевозчиков Даниил
 *
 * --------------------------------------
 * | Ввести целое число и определить, верно ли, что в его записи есть две одинаковые цифры, НЕ обязательно стоящие рядом. |
 * --------------------------------------
*/

#include "stdio.h"

int main()
{
    int a, b = 0, c, res = 0;
    scanf("%d", &a);

    if (a == 0)
        printf("NO");
        
    while (a > 0)
    {
        c = a;
        while (c > 0)
        {
            b = c % 10;
            if (b == a % 10) {
                res++;
            }
            c /= 10;
        }


        if (res >= 2) {
            printf("YES");
            break;
        }

        if (a < 10) {
            printf("NO");
            break;
        }
        res = 0;
        a /= 10;
    }
    return 0;
}