/**
 * @author Перевозчиков Даниил
 *
 * --------------------------------------
 * | Ввести целое число и определить, верно ли, что в нём ровно одна цифра «9». |
 * --------------------------------------
 */

#include "stdio.h"

int main()
{
    int a, b, c = 9, res;
    scanf("%d", &a);

    while (a >= 0)
    {
        b = a % 10;

        if (b == c)
        {
            res++;
        }

        if (a < 10)
        {
            if (res == 1)
            {
                printf("YES");
                break;
            }
            else
            {
                printf("NO");
                break;
            }
        }
        a /= 10;
    }
    return 0;
}