/**
 * @author Перевозчиков Даниил
 *
 * --------------------------------------
 * | Ввести целое число и определить, верно ли, что все его цифры четные. |
 * --------------------------------------
 */

#include "stdio.h"

int main()
{
    int a, b, res;
    scanf("%d", &a);

    while (a > 0)
    {
        b = a % 10;
        if ((b / 2) * 2 != b) {
            printf("NO");
            break;
        }

        if (a < 10) {
            printf("YES");
            break;
        }
        a /= 10;
    }
    return 0;
}